---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutZoneInOption
source: html/43eb04d5-033f-c28b-9947-edf567726820.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutZoneInOption Property

HVAC Zones must be in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPutZoneInOption { get; }
```